/***************************************************************************
 * ROM Properties Page shell extension. (libromdata)                       *
 * NESMappers.cpp: NES mapper data.                                        *
 *                                                                         *
 * Copyright (c) 2016-2021 by David Korth.                                 *
 * Copyright (c) 2016-2018 by Egor.                                        *
 * SPDX-License-Identifier: GPL-2.0-or-later                               *
 ***************************************************************************/

#include "stdafx.h"
#include "NESMappers.hpp"

namespace LibRomData {

/**
 * References:
 * - https://wiki.nesdev.com/w/index.php/Mapper
 * - https://wiki.nesdev.com/w/index.php/NES_2.0_submappers
 */

// Mirroring behaviors for different mappers
enum NESMirroringType {
	MIRRORING_UNKNOWN = 0,		// When submapper has this value, it inherits mapper's value
	// NOTE: for all of these we assume that if 4-Screen bit is set it means that the mapper's
	// logic gets ignored, and there's simply 4K of SRAM at $2000. For more complicated mappers
	// (MMC5) this would actually be a downgrade, and maybe even impossible, but iNES format
	// applies the same logic to all mappers (except 30 and 218, see below)
	// Reference: http://wiki.nesdev.com/w/index.php/NES_2.0#Hard-Wired_Mirroring
	// NOTE: H/V/A/B refers to CIRAM A10 being connected to PPU A11/A10/Vss/Vdd respectively
	// NOTE: boards that only ever existed in H or V configuration still use the H/V bit.
	MIRRORING_HEADER,		// fixed H/V (the default)
	MIRRORING_MAPPER,		// Mapper-controlled (unspecified)
	MIRRORING_MAPPER_HVAB,		// - switchable H/V/A/B (e.g. MMC1)
	MIRRORING_MAPPER_HV,		// - switchable H/V     (e.g. MMC3)
	MIRRORING_MAPPER_AB,		// - switchable A/B     (e.g. AxROM)
	MIRRORING_MAPPER_MMC5,		// - arbitrary configuration with 3 NTs and fill mode
	MIRRORING_MAPPER_NAMCO163,	// - arbitrary configuration with 2 RAM and 224 ROM NTs
	MIRRORING_MAPPER_VRC6,		// - it's complicated (Konami games only use H/V/A/B)
	MIRRORING_MAPPER_JY,		// - J.Y. Company ASIC mapper (also complicated)
	MIRRORING_MAPPER_SUNSOFT4,	// - switchable H/V/A/B with 2 RAM and 128 ROM NTs
	MIRRORING_MAPPER_NAMCOT3425,	// - H but you can select how PPU A11 maps to CIRAM A10
					//   (effectively it's selectable H/A/B/swapped-H)
	MIRRORING_MAPPER_GTROM,		// - paged 4 screen RAM
	MIRRORING_MAPPER_TxSROM,	// - arbitrary configuration with 2 NTs
	MIRRORING_MAPPER_SACHEN8259,	// - switchable H/V/A/L-shaped (A10 or A11)
	MIRRORING_MAPPER_SACHEN74LS374N,// - switchable H/V/A/L-shaped (A10 and A11)
	MIRRORING_MAPPER_DIS23C01,	// - switchable H/V. A on reset.
	MIRRORING_MAPPER_233,		// - switchable H/V/B/L-shaped (A10 and A11)
	MIRRORING_MAPPER_235,		// - switchable H/V/A
	MIRRORING_1SCREEN_A,		// fixed A
	MIRRORING_1SCREEN_B,		// fixed B
					// (the distinction is only relevant for Magic Floor)
	MIRRORING_4SCREEN,		// 4 screen regardless of header (e.g. Vs. System)
	// The following mappers interpret the header bits differently
	MIRRORING_UNROM512,		// fixed H/V/4 or switchable A/B (mapper 30)
	MIRRORING_BANDAI_FAMILYTRAINER,	// fixed H/V or switchable A/B (mapper 70) (see note below)
	MIRRORING_MAGICFLOOR,		// fixed H/V/A/B (mapper 218)

	// NOTE: fwNES describes mappers 70 and 78 as using 4 Screen bit to specify switchable A/B
	// - 70 normally has fixed H/V. For switchable A/B, 152 should be used instead.
	// - 78 has either switchable H/V or switchable A/B. Emulators default to one of those,
	// and use checksumming to detect the other. Submappers should be used instead.
};

class NESMappersPrivate
{
	private:
		// Static class.
		NESMappersPrivate();
		~NESMappersPrivate();
		RP_DISABLE_COPY(NESMappersPrivate)

	public:

		// iNES mapper list.
		struct MapperEntry {
			const char *name;		// Name of the board. (If unknown, nullptr.)
			const char *manufacturer;	// Manufacturer. (If unknown, nullptr.)
			NESMirroringType mirroring;	// Mirroring behavior.
		};
		static const MapperEntry mappers_plane0[];
		static const MapperEntry mappers_plane1[];
		static const MapperEntry mappers_plane2[];

		/**
		 * NES 2.0 submapper information.
		 *
		 * `deprecated` can be one of the following:
		 * - 0: Not deprecated.
		 * - >0: Deprecated, and this is the replacement mapper number.
		 * - 0xFFFF: Deprecated, no replacement.
		 *
		 * A submapper may be deprecated in favor of submapper 0, in which
		 * case the `deprecated` value is equal to that mapper's number.
		 * It is assumed that the replacement mapper always uses submapper 0.
		 */
		struct SubmapperInfo {
			uint8_t submapper;		// Submapper number.
			uint8_t reserved;
			uint16_t deprecated;
			const char *desc;		// Description.
			NESMirroringType mirroring;	// Mirroring behavior.
		};

		// Submappers.
		static const struct SubmapperInfo mmc1_submappers[];		// 001
		static const struct SubmapperInfo discrete_logic_submappers[];	// 002, 003, 007
		static const struct SubmapperInfo mmc3_submappers[];		// 004
		static const struct SubmapperInfo bandai_fcgx_submappers[];	// 016
		static const struct SubmapperInfo namco_129_164_submappers[];	// 019
		static const struct SubmapperInfo vrc4a_vrc4c_submappers[];	// 021
		static const struct SubmapperInfo vrc4ef_vrc2b_submappers[];	// 023
		static const struct SubmapperInfo vrc4bd_vrc2c_submappers[];	// 025
		static const struct SubmapperInfo irem_g101_submappers[];	// 032
		static const struct SubmapperInfo bnrom_nina001_submappers[];	// 034
		static const struct SubmapperInfo sunsoft4_submappers[];	// 068
		static const struct SubmapperInfo codemasters_submappers[];	// 071
		static const struct SubmapperInfo mapper078_submappers[];	// 078
		static const struct SubmapperInfo cony_yoko_submappers[];	// 083
		static const struct SubmapperInfo mapper114_submappers[];	// 114
		static const struct SubmapperInfo mapper197_submappers[];	// 197
		static const struct SubmapperInfo namcot_175_340_submappers[];	// 210
		static const struct SubmapperInfo sugar_softec_submappers[];	// 215
		static const struct SubmapperInfo quattro_submappers[];		// 232
		static const struct SubmapperInfo onebus_submappers[];		// 256
		static const struct SubmapperInfo smd132_smd133_submappers[];	// 268
		static const struct SubmapperInfo mapper313_submappers[];	// 313

		/**
		 * NES 2.0 submapper list.
		 *
		 * NOTE: Submapper 0 is optional, since it's the default behavior.
		 * It may be included if NES 2.0 submapper 0 acts differently from
		 * iNES mappers.
		 */
		struct SubmapperEntry {
			uint16_t mapper;		// Mapper number.
			uint16_t info_size;		// Number of entries in info.
			const SubmapperInfo *info;	// Submapper information.
		};
		static const SubmapperEntry submappers[];

		/**
		 * bsearch() comparison function for SubmapperInfo.
		 * @param a
		 * @param b
		 * @return
		 */
		static int RP_C_API SubmapperInfo_compar(const void *a, const void *b);

		/**
		 * bsearch() comparison function for SubmapperEntry.
		 * @param a
		 * @param b
		 * @return
		 */
		static int RP_C_API SubmapperEntry_compar(const void *a, const void *b);
};

/**
 * Mappers: NES 2.0 Plane 0 [000-255] (iNES 1.0)
 * TODO: Add more fields:
 * - Programmable mirroring
